# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

### Load Required Libraries

In [ ]:
import mysql.connector
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [ ]:
connection=mysql.connector.connect(host="localhost",user="root",passwd="Admin@12345")
cursorobject=connection.cursor()

### You are required to create a database named 'e_commerce'

In [3]:
cursorobject.execute("CREATE DATABASE if not exists e_commerce")
connection.close()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [7]:
connection=mysql.connector.connect(host="localhost",user="root",passwd="Admin@12345",database='e_commerce')
cursorobject=connection.cursor()

create_table_query=""" CREATE TABLE supplier(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), 
                        SUPP_PHONE varchar(10));
                       
                       CREATE TABLE customer(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL,
                       CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID));

                       CREATE TABLE category(CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID));

                       CREATE TABLE product(PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, 
                       PRO_DESC VARCHAR(60) NULL DEFAULT NULL,CAT_ID INT NOT NULL,
                       PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));

                       CREATE TABLE product_details(PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, 
                       PROD_PRICE INT NOT NULL,PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), 
                       FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));

                       CREATE TABLE `order`(ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL,
                       PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),
                       FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));

                       CREATE TABLE rating(RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, 
                       RAT_RATSTARS INT NOT NULL, PRIMARY KEY (RAT_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),
                       FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID));"""

cursorobject.execute(create_table_query,multi='true')         
connection.close()

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [9]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Admin@12345",
                                     database = 'e_commerce')
cursorobject = connection.cursor()

insert_into_supplier = """INSERT INTO supplier (SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES (%s, %s, %s, %s);"""

val = [(1, 'Rajesh Retails', 'Delhi', '1234567890'),(2, 'Appario Ltd.', 'Mumbai', '8963147032'),
      (3, 'Knome products', 'Bangalore', '9785462315'),(4, 'Bansal Retails', 'Kochi', '8975463285'),
      (5, 'Mittal Ltd.', 'Lucknow', '7898456532')]

cursorobject.executemany(insert_into_supplier, val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [16]:
insert_into_customer = """INSERT INTO customer (CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER) 
                            VALUES (%s, %s, %s, %s, %s);"""

val = [(1, 'AAKASH', '9999999999', 'DELHI','M'),(2, 'AMAN', '9785463215', 'NOIDA','M'),
      (3, 'NEHA', '9999999998', 'MUMBAI','F'),(4, 'MEGHA', '9994562399', 'KOLKATA','F'),
      (5, 'PULKIT', '7895999999', 'LUCKNOW','M')]

cursorobject.executemany(insert_into_customer, val)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [12]:
insert_into_category = """INSERT INTO category (CAT_ID, CAT_NAME) 
                            VALUES (%s, %s);"""

val = [(1, 'BOOKS'),(2, 'GAMES'),
      (3, 'GROCERIES'),(4, 'ELECTRONICS'),
      (5, 'CLOTHES')]

cursorobject.executemany(insert_into_category, val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [13]:

insert_into_product = """INSERT INTO product (PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) 
                            VALUES (%s, %s, %s, %s);"""

val = [(1, 'GTA V', 'DFJDJFDJFDJFDJFJF', 2),(2, 'TSHIRT', 'DFDFJDFJDKFD', 5),
      (3, 'ROG LAPTOP', 'DFNTTNTNTERND', 4),(4, 'OATS', 'REURENTBTOTH', 3),
      (5, 'HARRY POTTER', 'NBEMCTHTJTH', 1)]

cursorobject.executemany(insert_into_product, val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [14]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Admin@12345",
                                     database = 'e_commerce')
cursorobject = connection.cursor()

insert_into_prod_dtls = """INSERT INTO product_details (PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE) 
                            VALUES (%s, %s, %s, %s);"""

val = [(1, 1, 2, 1500),(2, 3, 5, 30000),
      (3, 5, 1, 3000),(4, 2, 3, 2500),
      (5, 4, 1, 1000)]

cursorobject.executemany(insert_into_prod_dtls, val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [17]:
insert_into_order = """INSERT INTO `order` (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) 
                            VALUES (%s, %s, %s, %s, %s);"""

val = [(20, 1500, '2021-10-12', 3, 5),(2, 30500, '2021-09-16', 5, 2),
      (3, 2000, '2021-10-05', 1, 1),(4, 3500, '2021-08-16', 4, 3),
      (5, 2000, '2021-10-06', 2, 1)]

cursorobject.executemany(insert_into_order, val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [18]:
insert_into_rating = """INSERT INTO rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) 
                            VALUES (%s, %s, %s, %s);"""

val = [(1, 2, 2, 4),(2, 3, 4, 3),
      (3, 5, 1, 5),(4, 1, 3, 2),
      (5, 4, 5, 4)]

cursorobject.executemany(insert_into_rating, val)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [4]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Admin@12345",
                                     database = 'e_commerce')
cursorobject = connection.cursor()

query_3="""select t.cus_gender,count(t.cus_gender) as count from
            (select customer.* from customer,`order` where
            `order`.cus_id=customer.cus_id  and `order`.ord_amount>=3000) as t 
            group by t.cus_gender;"""

cursorobject.execute(query_3)
output_3=cursorobject.fetchall()
panda_3= pd.DataFrame(output_3,columns=['CUS_GENDER','COUNT'])    
panda_3

  CUS_GENDER  COUNT
0          M      1
1          F      1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [5]:
query_4 = """  select `order`.* ,product.pro_name from `order`,product,product_details where `order`.cus_id=2 and
                product.pro_id = product_details.pro_id and `order`.prod_id=product_details.prod_id;  
            """

cursorobject.execute(query_4) 
output_4=cursorobject.fetchall()
panda_4=pd.DataFrame(output_4,columns=['ORDER_ID','AMOUNT','ORDER_DATE','CUSTOMER_ID','PRODUCT_ID','PRODUCT_NAME'])
panda_4

   ORDER_ID  AMOUNT  ORDER_DATE  CUSTOMER_ID  PRODUCT_ID PRODUCT_NAME
0         5    2000  2021-10-06            2           1        GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [6]:
query_5 = """select supplier.* from supplier where supp_id in
            (select supp_id from product_details group by supp_id having count(supp_id)>1 );"""
            
cursorobject.execute(query_5)
output_5 = cursorobject.fetchall()
pd.DataFrame(output_5,columns=['SUPPLIER_ID','SUPPLIER_NAME','CITY','PHONE'])

   SUPPLIER_ID   SUPPLIER_NAME   CITY       PHONE
0            1  Rajesh Retails  Delhi  1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [7]:
query_6="""select category.* from category, product,product_details where product_details.prod_price
            in(select min(prod_price) from product_details) and 
            category.cat_id=product.cat_id and product.pro_id=product_details.pro_id;"""

cursorobject.execute(query_6)            
output_6=cursorobject.fetchall()
pd.DataFrame(output_6,columns=['CATEGORY_ID','NAME'])

   CATEGORY_ID       NAME
0            3  GROCERIES

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [8]:

query_7="""select product.pro_id, product.pro_name, `order`.ord_date from product,`order`,product_details 
            where `order`.ord_date='2021-10-05' and
            product.pro_id=product_details.pro_id and
           `order`.prod_id=product_details.prod_id;"""
        
cursorobject.execute(query_7)
output_7=cursorobject.fetchall()
pd.DataFrame(output_7,columns=['Product_Id','Product_Name','Date'])

   Product_Id Product_Name        Date
0           1        GTA V  2021-10-05

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [9]:
query_8 = """SELECT SUPPLIER.SUPP_ID, SUPPLIER.SUPP_NAME, CUSTOMER.CUS_ID, CUSTOMER.CUS_NAME, RATING.RAT_RATSTARS FROM RATING 
              INNER JOIN SUPPLIER ON RATING.SUPP_ID = SUPPLIER.SUPP_ID 
              INNER JOIN CUSTOMER ON RATING.CUS_ID = CUSTOMER.CUS_ID 
              ORDER BY RATING.RAT_RATSTARS DESC LIMIT 3;"""

cursorobject.execute(query_8)
output_8 = cursorobject.fetchall()
panda_8 = pd.DataFrame(output_8, columns=['SUPP_ID','SUPP_NAME','CUS_ID','CUS_NAME','RAT_RATSTARS'])
panda_8

   SUPP_ID       SUPP_NAME  CUS_ID CUS_NAME  RAT_RATSTARS
0        1  Rajesh Retails       5   PULKIT             5
1        2    Appario Ltd.       2     AMAN             4
2        5     Mittal Ltd.       4    MEGHA             4

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [10]:
query_9="""select cus_name as Name,cus_gender as Gender from customer
            where cus_name like 'A%' or cus_name like '%A' """

cursorobject.execute(query_9)          
output_9=cursorobject.fetchall()
pd.DataFrame(output_9,columns=['Customer Name','Gender'])

  Customer Name Gender
0        AAKASH      M
1          AMAN      M
2          NEHA      F
3         MEGHA      F

### Q10) Display the total order amount of the male customers.

In [11]:
query_10="""select sum(`order`.ord_amount) as Total_Amount from `order` 
             where cus_id in(select cus_id from customer where cus_gender='M');"""


cursorobject.execute(query_10)             
output_10=cursorobject.fetchall()
pd.DataFrame(output_10,columns=['Total Amount'])

  Total Amount
0        34500

### Q11) Display all the Customers left outer join with  the orders

In [12]:
query_11="""select customer.*,`order`.ord_id,`order`.ord_amount,`order`.ord_date,`order`.prod_id from 
             customer left join `order` on
            `order`.cus_id=customer.cus_id"""

cursorobject.execute(query_11)
output_11=cursorobject.fetchall()            
pd.DataFrame(output_11,columns=['CUS_ID','CUS_NAME','CUS_PHONE','CUS_CITY','CUS_GENDER',
                                          'ORD_ID','ORD_AMOUNT','ORD_DATE','PROD_ID'])

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,PROD_ID
0,1,AAKASH,9999999999,DELHI,M,3,2000,2021-10-05,1
1,2,AMAN,9785463215,NOIDA,M,5,2000,2021-10-06,1
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,5
3,4,MEGHA,9994562399,KOLKATA,F,4,3500,2021-08-16,3
4,5,PULKIT,7895999999,LUCKNOW,M,2,30500,2021-09-16,2

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)